[
    {
      "id": 1,
      "book_name": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/q06v4qX/card-Book1.jpg",
      "review": "'The Great Gatsby' is a quintessential American novel set in the roaring twenties. It explores themes of love, wealth, and the elusive American Dream through the eyes of narrator Nick Carraway, who becomes entangled in the lives of his mysterious neighbor Jay Gatsby and his cousin Daisy Buchanan. Fitzgerald's prose is elegant and evocative, painting a vivid portrait of the Jazz Age and the moral decay of the wealthy elite.",
      "total_pages": 180,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Classics", "Romance"],
      "publisher": "Scribner",
      "yearOfPublishing": 1925
    },
    {
      "id": 2,
      "book_name": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/HNjx5nY/BST-MOC-RED-1-800x.webp",
      "review": "Harper Lee's masterpiece, 'To Kill a Mockingbird,' is a powerful exploration of racial injustice and moral integrity in the Deep South. Through the eyes of young Scout Finch, the novel tackles themes of prejudice, empathy, and the complexities of human nature. Atticus Finch, Scout's father, emerges as a moral beacon in a society plagued by bigotry and hatred.",
      "total_pages": 281,
      "rating": 4.8,
      "category": "Fiction",
      "tags": ["Classics", "Social Issues"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "id": 3,
      "book_name": "1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/Rz35d8j/card-Book3.jpg",
      "review": "'1984' is a dystopian classic that warns of the dangers of totalitarianism and surveillance. Set in a repressive regime where individuality is suppressed and truth is manipulated, Orwell's novel follows protagonist Winston Smith as he rebels against the oppressive Party led by Big Brother. '1984' remains a chilling reminder of the importance of freedom and resistance in the face of tyranny.",
      "total_pages": 328,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Dystopian", "Political"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "id": 4,
      "book_name": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/kDg7L84/card-Book4.jpg",
      "review": "Jane Austen's beloved novel 'Pride and Prejudice' is a witty and romantic comedy of manners set in early 19th-century England. The story revolves around the spirited Elizabeth Bennet and the proud Mr. Darcy as they navigate misunderstandings, social conventions, and their own prejudices on the path to love and self-discovery.",
      "total_pages": 279,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Classics", "Romance"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "id": 5,
      "book_name": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/g9FQKJT/card-Book5.jpg",
      "review": "J.D. Salinger's 'The Catcher in the Rye' is a coming-of-age novel that captures the angst and alienation of adolescence. Narrated by the rebellious Holden Caulfield, the novel follows his journey through New York City as he grapples with loss, identity, and the phoniness of the adult world. Salinger's poignant portrayal of teenage rebellion continues to resonate with readers of all ages.",
      "total_pages": 277,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["Coming of Age", "Cultural"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "id": 6,
      "book_name": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/TWrzXfZ/card-Book6.jpg",
      "review": "'The Hobbit' is a timeless adventure tale that introduces readers to the enchanting world of Middle-earth. Bilbo Baggins, a reluctant hobbit, is swept away on a quest to reclaim a lost treasure guarded by the fearsome dragon Smaug. Along the way, he encounters elves, dwarves, and a mysterious creature named Gollum. Tolkien's richly imagined universe and captivating storytelling make 'The Hobbit' a beloved classic of fantasy literature.",
      "total_pages": 310,
      "rating": 4.9,
      "category": "Fantasy",
      "tags": ["Adventure", "Quest"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
    },
    {
      "id": 7,
      "book_name": "The Alchemist",
      "author": "Paulo Coelho",
      "image": "https://i.ibb.co/yg7GpzZ/card-Book7.jpg",
      "review": "Paulo Coelho's 'The Alchemist' is a spiritual fable about the journey of self-discovery and the pursuit of one's dreams. Santiago, a young shepherd boy, embarks on a quest to find his Personal Legend and encounters wise mentors, mystical omens, and unexpected challenges along the way. Through Santiago's transformative journey, Coelho imparts timeless wisdom about following one's heart and embracing the unknown.",
      "total_pages": 197,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["Philosophical", "Spiritual"],
      "publisher": "HarperCollins",
      "yearOfPublishing": 1988
    },
    {
      "id": 8,
      "book_name": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/ZBrjDC2/the-lord-of-the-rings-by-jrr-tolkein-C911-XW.jpg",
      "review": "J.R.R. Tolkien's epic fantasy trilogy, 'The Lord of the Rings,' is a sweeping tale of heroism, friendship, and the struggle against darkness. Frodo Baggins, aided by a fellowship of companions, sets out on a perilous quest to destroy the One Ring and defeat the dark lord Sauron. Set against the backdrop of Middle-earth, Tolkien's magnum opus is a masterful blend of myth, adventure, and profound themes.",
      "total_pages": 1178,
      "rating": 5.0,
      "category": "Fantasy",
      "tags": ["Epic", "Adventure"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1954
    },
    {
        "id": 9,
        "book_name": "Harry Potter and the Philosopher",
        "author": "J.K. Rowling",
        "image": "https://i.ibb.co/ggKBprN/card-Book9.jpg",
        "review": "J.K. Rowling's 'Harry Potter and the Philosopher's Stone' introduces readers to the magical world of Hogwarts School of Witchcraft and Wizardry. Follow young Harry Potter as he discovers his identity as a wizard, makes lifelong friends, and confronts the dark wizard Voldemort. Rowling's imaginative storytelling, engaging characters, and themes of friendship and courage have made the Harry Potter series a cultural phenomenon.",
        "total_pages": 223,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": ["Magic", "Wizardry"],
        "publisher": "Bloomsbury",
        "yearOfPublishing": 1997
      }
  ]
  